Revit 2027 API
ExporterIFCUtils.SortFaceEdges Method
 Sorts the edges of a face such that the outer edge loops and their corresponding inner edge loops are separated.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IList<int>> SortFaceEdges(
	Face face
)
Public Shared Function SortFaceEdges (
	face As Face
) As IList(Of IList(Of Integer))
public:
static IList<IList<int>^>^ SortFaceEdges(
	Face^ face
)
static member SortFaceEdges :
        face : Face -> IList<IList<int>>
Parameters
face Face
 The face.
Return Value
IList<IList<Int32>>
 The list of outer edge loops and their corresponding inner edge loops, by their index.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Each entry of the array represents an array of indices, where the first index corresponds to an outer edge loop and the rest of the indices correspond to 0 or more inner edge loops contained inside the outer edge loop. Loops are assumed to be non-intersecting, and there will be no nesting of inner loops (that is, an inner loop of an inner loop is another outer loop). The indices correspond to entries in the collection of edge loops returned by Face.EdgeLoops.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace